#Наибольшее произведение четырех последовательных цифр в нижеприведенном 1000-значном числе
# равно 9 × 9 × 8 × 9 = 5832.
#Найдите наибольшее произведение тринадцати последовательных цифр в данном числе.

a = 7316717653133062491922511967442657474235534919493496983520312774506326239578318016984801869478851843858615607891129494954595017379583319528532088055111254069874715852386305071569329096329522744304355766896648950445244523161731856403098711121722383113622298934233803081353362766142828064444866452387493035890729629049156044077239071381051585930796086670172427121883998797908792274921901699720888093776657273330010533678812202354218097512545405947522435258490771167055601360483958644670632441572215539753697817977846174064955149290862569321978468622482839722413756570560574902614079729686524145351004748216637048440319989000889524345065854122758866688116427171479924442928230863465674813919123162824586178664583591245665294765456828489128831426076900422421902267105562632111110937054421750694165896040807198403850962455444362981230987879927244284909188845801561660979191338754992005240636899125607176060588611646710940507754100225698315520005593572972571636269561882670428252483600823257530420752963450
import razbienie
import functools
numbers = razbienie.razbienie(a) # разбили на числ и добавили в numbers
k=len(numbers) # = 1000 цифр
time = []
time.append(numbers[0]) #в тайм (временный) будут временно храниться 13 цифр, затем мы удаляем первй из него и добавляем следующий, одновременно умножая их и запоминая лучшую сумму
time.append(numbers[1])
time.append(numbers[2])
time.append(numbers[3])
time.append(numbers[4]) 
time.append(numbers[5]) 
time.append(numbers[6]) 
time.append(numbers[7]) 
time.append(numbers[8]) 
time.append(numbers[9]) 
time.append(numbers[10]) 
time.append(numbers[11]) 
time.append(numbers[12]) 
#сейчас для умножения доступно первых 4 цифра из numbers
def multiply(x,y,w,z,a,b,c,d,e,f,g,h,i):
	sum = x*y*w*z*a*b*c*d*e*f*g*h*i
	return sum
x = 0 # МАКСИМАЛЬНОЕ ЗНАЧЕНИЕ ПРОИЗВЕДЕНИЯ 
tr = 14 
while tr <= k: #количество попыток 
	print('Попытка №',tr)
	t=multiply(time[0],time[1],time[2],time[3],time[4],time[5],time[6],time[7],time[8],time[9],time[10],time[11],time[12])
	print('Произведение новых 13-и чисел ',t,'. Лучшее произведение', x )
	numbers.remove(time[0])
	time.remove(time[0])
	time.append(numbers[12])
	tr = tr + 1
	if t > x:
		x = t


print('Максимальное произведение',x)
